CFD-2D-Channel-Flow/0_case_files/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
  {
      type            fixedValue;
      value           uniform 0; // Or some other relevant pressure value
  }
        walls
    {
        type            zeroGradient;
    }
        wallBottom
    {
        type            zeroGradient;
    }
        wallTop
    {
        type            zeroGradient;
    }


    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
